# SunriseToSunset Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
SunAndShadowSettings..::..SunriseToSunset Property
SunAndShadowSettings Class See Also
---
Identifies whether the current single day sun study is set to run from sunrise to sunset.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public bool SunriseToSunset { get; set; }
```

Visual Basic
---
```text
Public Property SunriseToSunset As Boolean
	Get
	Set
```

Visual C++
---
```text
public:
property bool SunriseToSunset {
	bool get ();
	void set (bool value);
}
```

# See Also
SunAndShadowSettings Class
Autodesk.Revit.DB Namespace